; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	infrared1 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
)
(:goal (and
	(have_image Star5 image2)
	(have_image Star6 image2)
	(have_image Planet7 infrared0)
	(have_image Planet8 image2)
	(have_image Planet9 image2)
	(have_image Star10 infrared0)
	(have_image Star11 infrared0)
	(have_image Star12 infrared1)
	(have_image Planet13 image2)
	(have_image Phenomenon14 infrared1)
	(have_image Star15 infrared0)
	(have_image Star16 image2)
))

)

; plan
1. (turn_to satellite0 star4 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star4)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 0 of 12
5. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 1 of 12
6. (turn_to satellite0 planet8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet8)
   goals met: 1 of 12
7. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 2 of 12
8. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 12
9. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 3 of 12
10. (turn_to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   goals met: 3 of 12
11. (take_image satellite0 planet13 instrument0 image2)
   added: (have_image planet13 image2)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 5 of 12
14. (turn_to satellite0 star10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star10)
   goals met: 5 of 12
15. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 12
16. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 6 of 12
17. (take_image satellite0 star11 instrument0 infrared0)
   added: (have_image star11 infrared0)
   goals met: 7 of 12
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 12
19. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 8 of 12
20. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 8 of 12
21. (take_image satellite0 star15 instrument0 infrared0)
   added: (have_image star15 infrared0)
   goals met: 9 of 12
22. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 9 of 12
23. (take_image satellite0 star16 instrument0 image2)
   added: (have_image star16 image2)
   goals met: 10 of 12
24. (turn_to satellite0 star5 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star5)
   goals met: 10 of 12
25. (take_image satellite0 star5 instrument0 image2)
   added: (have_image star5 image2)
   goals met: 11 of 12
26. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 11 of 12
27. (take_image satellite0 star6 instrument0 image2)
   added: (have_image star6 image2)
   goals met: 12 of 12
